tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "spl/pdftk"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Ruby version manager
brew "rbenv"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Git client focusing on productivity
cask "gitkraken"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Open-source code editor
cask "visual-studio-code"
