tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "spl/pdftk"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"

# Development kit for the Java programming language
brew "openjdk"
# Ruby version manager
brew "rbenv"

# need to install java before jenkins
brew 'java'
brew 'jenkins'
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Git client focusing on productivity
cask "gitkraken"
# Open-source code editor
cask "visual-studio-code"
# Google
cask 'google-drive'

cask 'slack'
cask 'spotify'
cask 'dotnet'

=begin  
http://railsapps.github.io/openssl-certificate-verify-failed.html

A CA file has been bootstrapped using certificates from the system
keychain. To add additional certificates, place .pem files in
/opt/homebrew/etc/openssl@3/certs

and run
/opt/homebrew/opt/openssl@3/bin/c_rehash

openssl@3 is keg-only, which means it was not symlinked into /opt/homebrew,
because macOS provides LibreSSL.

If you need to have openssl@3 first in your PATH, run:
echo 'export PATH="/opt/homebrew/opt/openssl@3/bin:$PATH"' >> ~/.zshrc

For compilers to find openssl@3 you may need to set:
export LDFLAGS="-L/opt/homebrew/opt/openssl@3/lib"
export CPPFLAGS="-I/opt/homebrew/opt/openssl@3/include"

For pkg-config to find openssl@3 you may need to set:
export PKG_CONFIG_PATH="/opt/homebrew/opt/openssl@3/lib/pkgconfig" 

Linking /opt/homebrew/Cellar/openssl@3/3.0.0_1... 5482 symlinks created.

If you need to have this software first in your PATH instead consider running:
  echo 'export PATH="/opt/homebrew/opt/openssl@3/bin:$PATH"' >> ~/.zshrc
  =end

  =begin
  https://www.digitalocean.com/community/tutorials/how-to-install-ruby-on-rails-with-rbenv-on-macos
https://pjbelo.medium.com/using-google-maps-api-v3-with-rails-5-2-b066a4b2cf14

http://railsapps.github.io/openssl-certificate-verify-failed.html

  =end

