tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "spl/pdftk"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Platform built on V8 to build network applications
brew "node"
brew "yarn"
# Development kit for the Java programming language
brew "openjdk"
# Ruby version manager
brew "rbenv"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
brew "coreutils"
tap 'neovim/neovim' || true
brew 'neovim'
# ?brew 'rails','-v 6.1.4.1'
brew 'openssl'
# need to install java before jenkins
brew 'java'
brew 'jenkins'
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Git client focusing on productivity
cask "gitkraken"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Open-source code editor
cask "visual-studio-code"
# Google
cask 'google-drive'

cask 'slack'
cask 'spotify'


=begin  
http://railsapps.github.io/openssl-certificate-verify-failed.html

A CA file has been bootstrapped using certificates from the system
keychain. To add additional certificates, place .pem files in
/opt/homebrew/etc/openssl@3/certs

and run
/opt/homebrew/opt/openssl@3/bin/c_rehash

openssl@3 is keg-only, which means it was not symlinked into /opt/homebrew,
because macOS provides LibreSSL.

If you need to have openssl@3 first in your PATH, run:
echo 'export PATH="/opt/homebrew/opt/openssl@3/bin:$PATH"' >> ~/.zshrc

For compilers to find openssl@3 you may need to set:
export LDFLAGS="-L/opt/homebrew/opt/openssl@3/lib"
export CPPFLAGS="-I/opt/homebrew/opt/openssl@3/include"

For pkg-config to find openssl@3 you may need to set:
export PKG_CONFIG_PATH="/opt/homebrew/opt/openssl@3/lib/pkgconfig" 

Linking /opt/homebrew/Cellar/openssl@3/3.0.0_1... 5482 symlinks created.

If you need to have this software first in your PATH instead consider running:
  echo 'export PATH="/opt/homebrew/opt/openssl@3/bin:$PATH"' >> ~/.zshrc
  =end

  =begin
  https://www.digitalocean.com/community/tutorials/how-to-install-ruby-on-rails-with-rbenv-on-macos
https://pjbelo.medium.com/using-google-maps-api-v3-with-rails-5-2-b066a4b2cf14

http://railsapps.github.io/openssl-certificate-verify-failed.html

  =end

==> Formulae
aom			gdal			jpeg-xl			libtool			nspr			qt
assimp			gdbm			jq			libuv			nss			qt@5
autoconf		geos			json-c			libvmaf			numpy			rbenv
autossh			gettext			krb5			libvterm		nvm			readline
awscli			gh			libaec			libx11			oniguruma		redis
bat			ghostscript		libb2			libxau			openblas		ruby-build
boost			giflib			libdap			libxcb			openexr			sbt
brotli			git			libde265		libxdmcp		openjdk			scala
c-ares			git-lfs			libevent		libxext			openjdk@11		sfcgal
ca-certificates		glib			libffi			libxml2			openjpeg		shared-mime-info
cairo			gmp			libgeotiff		libxrender		openssl@1.1		six
cfitsio			gnu-getopt		libheif			libyaml			pcre			sqlite
cgal			graphite2		libiconv		little-cms2		pcre2			szip
clamav			harfbuzz		libidn			luajit-openresty	pex			tree
coreutils		hdf5			liblqr			luv			pixman			tree-sitter
dbus			highway			libmagic		lz4			pkg-config		unibilium
docbook			httpie			libmng			lzo			poppler			unixodbc
docbook-xsl		hunspell		libmpc			m4			poppler-qt5		webp
docker			icu4c			libnghttp2		macos-term-size		popt			x265
docker-compose		imagemagick		libomp			maven			postgis			xerces-c
double-conversion	imath			libpng			md4c			postgresql		xmlto
eigen			isl			libpq			memcached		postgresql@11		xorgproto
epsilon			jansson			libpqxx			minizip			postgresql@14		xpdf
exa			jasper			libpthread-stubs	mpdecimal		proj			xz
expat			jbig2dec		libraw			mpfr			proj@7			yara
fontconfig		jenkins			librttopo		msgpack			protobuf		zstd
freetype		jenv			libspatialite		neovim			protobuf-c
freexl			jpeg			libtermkey		netcdf			python@3.10
gcc			jpeg-turbo		libtiff			node@12			python@3.9

==> Casks
1password-cli		chromium		google-chrome		microsoft-auto-update	visual-studio-code
adoptopenjdk13		dropbox			google-drive		microsoft-edge
alfred			gitkraken		grammarly		spotify